Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfo
The Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfo class describes view data as relevant to the displaying of graphics.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfo.GlobalView
Gets a Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfo instance identifying the global view.
Invalid of the variables - except for Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfo.Identifier - are valid.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfo.MaxRealCameraToCameraAxisAngle
The maximum Tekla.Common.Geometry.Angle between the real camera direction and Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfo.CameraAxis.
When the real angle is greater than this value, Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfo.CameraAxis requires to be updated.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfo.view
The Tekla.Structures.Model.UI.View to expose properties from.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfo.viewCamera
The Tekla.Structures.Model.UI.ViewCamera to expose properties from.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfo.lastRefreshReason
The Tekla.BIM.DirectManipulation.Services.Graphics.ViewUpdateReason indicates whether and why it was necessary to update the view.
GlobalView or invalid view or invalid view camera uses Invalid as the reason.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfo.#ctor(System.Int32)
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfo class.
viewIdentifier: The identifier of the view to provide the information for.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfo.#ctor
Prevents a default instance of the Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfo class from being created.
The Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfo.Identifier is set to identify the global view.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfo.CameraAxis
Gets the main camera axis for the view.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfo.CameraDirection
Gets the camera direction.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfo.CameraZoomFactor
Gets the camera zoom factor.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfo.ClippingPlanes
Gets the clipping planes of the view.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfo.CoordinateSystem
Gets the local coordinate system for the view, as specified when creating the view.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfo.Identifier
Gets the identifier of the view.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfo.ProjectionType
Gets the type of the view projection.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfo.WorkArea
Gets the work area active on the view, as an Tekla.Common.Geometry.AxisAlignedBox3 value.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfo.ReasonOfLastRefresh
Gets the reason of the previous refresh.
The last refresh reason indicates the last reason for refreshing the view.
It might not have been necessary or possible to refresh the view.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfo.RenderingType
Gets the type of the rendering.

Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfo.Refresh
Refreshes the Tekla.Structures.DirectManipulation.Adapter.Graphics.GraphicsViewInfo and returns an indication of what has actually changed.
Returns: An indication of what has actually changed.